results/runs/ycsb/2026-05-17T10-33-33/redis/run_workload_f.txt
/opt/java/openjdk/bin/java  -classpath /ycsb/conf:/ycsb/lib/HdrHistogram-2.1.4.jar:/ycsb/lib/core-0.17.0.jar:/ycsb/lib/htrace-core4-4.1.0-incubating.jar:/ycsb/lib/jackson-core-asl-1.9.4.jar:/ycsb/lib/jackson-mapper-asl-1.9.4.jar:/ycsb/redis-binding/lib/commons-pool2-2.4.2.jar:/ycsb/redis-binding/lib/jedis-2.9.0.jar:/ycsb/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -t -db site.ycsb.db.RedisClient -s -P workloads/workloadf -p redis.host=redis -p redis.port=6379 -p recordcount=100000 -p operationcount=100000 -p threadcount=10
Command line: -t -db site.ycsb.db.RedisClient -s -P workloads/workloadf -p redis.host=redis -p redis.port=6379 -p recordcount=100000 -p operationcount=100000 -p threadcount=10
YCSB Client 0.17.0

Loading workload...
Starting test.
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[...]
2026-05-17 10:30:51:371 0 sec: 0 operations; est completion in 0 second 
2026-05-17 10:30:57:690 6 sec: 100000 operations; 15715.86 current ops/sec; [READ: Count=100000, Max=16543, Min=75, Avg=418, 90=560, 99=944, 99.9=3857, 99.99=11855] [READ-MODIFY-WRITE: Count=49877, Max=42111, Min=179, Avg=832.3, 90=1095, 99=1764, 99.9=4999, 99.99=36703] [CLEANUP: Count=10, Max=1294, Min=44, Avg=222.6, 90=206, 99=1294, 99.9=1294, 99.99=1294] [UPDATE: Count=49877, Max=12159, Min=70, Avg=409.24, 90=554, 99=940, 99.9=2393, 99.99=9927] 
[OVERALL], RunTime(ms), 6363
[OVERALL], Throughput(ops/sec), 15715.857300015716
[TOTAL_GCS_G1_Young_Generation], Count, 9
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 41
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.6443501493006444
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 9
[TOTAL_GC_TIME], Time(ms), 41
[TOTAL_GC_TIME_%], Time(%), 0.6443501493006444
[READ], Operations, 100000
[READ], AverageLatency(us), 418.00399
[READ], MinLatency(us), 75
[READ], MaxLatency(us), 16543
[READ], 95thPercentileLatency(us), 636
[READ], 99thPercentileLatency(us), 944
[READ], Return=OK, 100000
[READ-MODIFY-WRITE], Operations, 49877
[READ-MODIFY-WRITE], AverageLatency(us), 832.3021232231289
[READ-MODIFY-WRITE], MinLatency(us), 179
[READ-MODIFY-WRITE], MaxLatency(us), 42111
[READ-MODIFY-WRITE], 95thPercentileLatency(us), 1225
[READ-MODIFY-WRITE], 99thPercentileLatency(us), 1764
[CLEANUP], Operations, 10
[CLEANUP], AverageLatency(us), 222.6
[CLEANUP], MinLatency(us), 44
[CLEANUP], MaxLatency(us), 1294
[CLEANUP], 95thPercentileLatency(us), 1294
[CLEANUP], 99thPercentileLatency(us), 1294
[UPDATE], Operations, 49877
[UPDATE], AverageLatency(us), 409.2440202899132
[UPDATE], MinLatency(us), 70
[UPDATE], MaxLatency(us), 12159
[UPDATE], 95thPercentileLatency(us), 630
[UPDATE], 99thPercentileLatency(us), 940
[UPDATE], Return=OK, 49877